DataProcessors/ПомощникПередачиПрав.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<DataProcessor>
		<Properties>
			<Name>ПомощникПередачиПрав</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтветственныйВладелец</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПотребителиУслуг</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоПрописанных</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоПроживающих</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Здание</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЗданияИСооружения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеЛС</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыпоняетсяПередачаДолга</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПриборыУчета</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ОбъектУстановки</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЛицевыеСчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПриборУчета</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПриборыУчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПоказаниеПредыдущее</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Показание</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Разница</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидТарифа</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыТарифов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Коэффициент</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Услуга</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Услуги</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОтветственныйВладелец</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПотребителиУслуг</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОбъектЛицевогоСчета</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ОбъектыЛицевыхСчетов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПереходЧерезНоль</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РасходЗаПериодРасчета</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Отключен</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаПоказаний</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СформированныеДокументы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Документ</Name>
							<Type>
								<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/ОтветственныйВладелецЛицевогоСчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>ОтветственныйВладелецЛицевогоСчета</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ОтветственныйВладелец</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПотребителиУслуг</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ПоверкиПриборовУчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>ПоверкиПриборовУчета</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПоверкаВыполнена</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ОбъектУстановки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПриборУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПриборыУчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/НазначенныеУслуги.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>НазначенныеУслуги</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Действует</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Услуги</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/НазначенныеУслугиПодробно.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>НазначенныеУслугиПодробно</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Действует</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Услуги</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УслугаПодробно</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УслугиСДПТПодробно</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/МашиноМеста.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>МашиноМеста</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>НомерМашиноМеста</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоМашиноМест</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>8</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидМашиноМеста</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыМашиноМест</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

AccumulationRegisters/РасчетыПоЛицевымСчетам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<AccumulationRegister>
		<Properties>
			<Name>РасчетыПоЛицевымСчетам</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Тариф</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДнейНачислено</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидНачисления</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыНачислений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидТарифа</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыТарифов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончанияПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтимулирующийТариф</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Порог</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПорогиТарифовУслуг</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗначениеПорога</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидНачисленияПерерасчет</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыНачислений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Услуги</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>МесяцНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Enums/ВидыОперацийУправленияУслугами.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Enum>
		<Properties>
			<Name>ВидыОперацийУправленияУслугами</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НазначениеУслуги</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтключениеУслуги</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПриостановкаУслуги</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВременноеНазначениеУслуги</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИзменениеКачестваУслуг</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

DataProcessors/ПомощникПередачиПрав/Forms/Форма/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Объект.Дата = ТекущаяДата();
	
	Объект.Организация = ОСМДПовтИсп.ПолучитьЗначениеПоУмолчаниюПользователя(Пользователи.ТекущийПользователь(), "ОсновнаяОрганизация");
	
	Если НЕ ЗначениеЗаполнено(Объект.Организация) Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		|	Организации.Ссылка КАК ОрганизацияСсылка
		|ИЗ
		|	Справочник.Организации КАК Организации
		|";
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			Объект.Организация = Выборка.ОрганизацияСсылка;
		КонецЕсли;
	КонецЕсли;
	
	Элементы.ГруппаПриборыУчета.Видимость = Истина;
	Элементы.ГруппаСформированныеДокументы.Видимость = Ложь;
	
	Локализация.ПриСозданииНаСервере(ЭтаФорма);
	
КонецПроцедуры


&НаКлиенте
Процедура ВыполнитьПередачуПрав(Команда)
	
	Если ПроверитьЗаполнение() Тогда
	
		Состояние(НСтр("ru='Идет формирование документов для выполнения передачи прав собственности ..."
"Пожалуйста, подождите.';uk='Йде формування документів для виконання передачі прав власності ..."
"Будь ласка, почекайте.'"));
		
		ВыполнитьПередачуПравНаСервере();
		
		Состояние(НСтр("ru='Формирование документов завершено.';uk='Формування документів завершене.'"));
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ВыполнитьПередачуПравНаСервере()
	
	НачатьТранзакцию();
	
	Комментарий = НСтр("ru='Сформировано обработкой Помощник передачи прав.';uk='Сформовано обробкою Помічник передачі прав.'");
	
	Объект.СформированныеДокументы.Очистить();
	
	ВыборкаОтветственныйВладелец = РегистрыСведений.ОтветственныйВладелецЛицевогоСчета.СрезПоследних( ,Новый Структура("ЛицевойСчет", Объект.ЛицевойСчет));
	Если ВыборкаОтветственныйВладелец.Количество() > 0 Тогда
		СтарыйОтветственныйВладелец = ВыборкаОтветственныйВладелец[0].ОтветственныйВладелец;
	Иначе	
		СтарыйОтветственныйВладелец = Справочники.ПотребителиУслуг.ПустаяСсылка();
	КонецЕсли; 
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ПоверкиПриборовУчетаСрезПоследних.ПриборУчета,
		|	ПоверкиПриборовУчетаСрезПоследних.Период
		|ИЗ
		|	РегистрСведений.ПоверкиПриборовУчета.СрезПоследних(
		|			,
		|			ОбъектУстановки = &ЛицевойСчет
		|				И ПоверкаВыполнена) КАК ПоверкиПриборовУчетаСрезПоследних
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПоверкиПриборовУчетаСрезПоследних.Период,
		|	ПоверкиПриборовУчетаСрезПоследних.ПриборУчета
		|ИЗ
		|	РегистрСведений.ПоверкиПриборовУчета.СрезПоследних(
		|			,
		|			ОбъектУстановки = &ЛицевойСчет
		|				И НЕ ПоверкаВыполнена) КАК ПоверкиПриборовУчетаСрезПоследних";
	
	Запрос.УстановитьПараметр("ЛицевойСчет", Объект.ЛицевойСчет);
	
	Результат = Запрос.ВыполнитьПакет();
	ТаблицаПоследнейПоверки = Результат[0].Выгрузить();
	ТаблицаСледующейПоверки = Результат[1].Выгрузить();
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	НазначенныеУслугиСрезПоследних.Услуга КАК Услуга
		|ИЗ
		|	РегистрСведений.НазначенныеУслуги.СрезПоследних(&Период, ЛицевойСчет = &ЛицевойСчет) КАК НазначенныеУслугиСрезПоследних
		|ГДЕ
		|	НазначенныеУслугиСрезПоследних.Действует";	
	
	Запрос.УстановитьПараметр("Период", Объект.Дата);
	Запрос.УстановитьПараметр("ЛицевойСчет", Объект.ЛицевойСчет);
	ТаблицаУслугЛС = Запрос.Выполнить().Выгрузить();
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	НазначенныеУслугиПодробноСрезПоследних.Услуга КАК Услуга,
		|	НазначенныеУслугиПодробноСрезПоследних.УслугаПодробно КАК УслугаПодробно
		|ИЗ
		|	РегистрСведений.НазначенныеУслугиПодробно.СрезПоследних(&Период, ЛицевойСчет = &ЛицевойСчет) КАК НазначенныеУслугиПодробноСрезПоследних
		|ГДЕ
		|	НазначенныеУслугиПодробноСрезПоследних.Действует";	
	
	Запрос.УстановитьПараметр("Период", Объект.Дата);
	Запрос.УстановитьПараметр("ЛицевойСчет", Объект.ЛицевойСчет);
	ТаблицаУслугПодробно = Запрос.Выполнить().Выгрузить();
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	МашиноМестаСрезПоследних.ЛицевойСчет,
		|	МашиноМестаСрезПоследних.ВидМашиноМеста,
		|	МашиноМестаСрезПоследних.НомерМашиноМеста,
		|	МашиноМестаСрезПоследних.КоличествоМашиноМест
		|ИЗ
		|	РегистрСведений.МашиноМеста.СрезПоследних(&Период, ЛицевойСчет = &ЛицевойСчет) КАК МашиноМестаСрезПоследних
		|ГДЕ
		|	МашиноМестаСрезПоследних.КоличествоМашиноМест <> 0";	
	
	Запрос.УстановитьПараметр("Период", Объект.Дата);
	Запрос.УстановитьПараметр("ЛицевойСчет", Объект.ЛицевойСчет);
	ТаблицаМашиноМест = Запрос.Выполнить().Выгрузить();
	
	
	ТаблицаПриборовУчета = Новый ТаблицаЗначений;
	ТаблицаПриборовУчета.Колонки.Добавить("ПриборУчета", Новый ОписаниеТипов("СправочникСсылка.ПриборыУчета"));
	ТаблицаПриборовУчета.Колонки.Добавить("ВидТарифа", Новый ОписаниеТипов("ПеречислениеСсылка.ВидыТарифов"));
	ТаблицаПриборовУчета.Колонки.Добавить("НачальноеПоказание", Новый ОписаниеТипов("Число"));
	ТаблицаПриборовУчета.Колонки.Добавить("ДатаПоследнейПоверки", Новый ОписаниеТипов("Дата"));
	ТаблицаПриборовУчета.Колонки.Добавить("ДатаСледующейПоверки", Новый ОписаниеТипов("Дата"));
	
	Для Каждого СтрокаПриборыУчета Из Объект.ПриборыУчета Цикл
		
		Если СтрокаПриборыУчета.Отключен Тогда
			Продолжить;
		КонецЕсли; 
		
		НоваяСтрока = ТаблицаПриборовУчета.Добавить();
		НоваяСтрока.ПриборУчета = СтрокаПриборыУчета.ПриборУчета;
		НоваяСтрока.НачальноеПоказание = СтрокаПриборыУчета.Показание;
		НоваяСтрока.ВидТарифа = СтрокаПриборыУчета.ВидТарифа;
		
		ВыборкаПоследнейПоверки = ТаблицаПоследнейПоверки.НайтиСтроки(Новый Структура("ПриборУчета", НоваяСтрока.ПриборУчета));   
		Если ВыборкаПоследнейПоверки.Количество() > 0  Тогда
			НоваяСтрока.ДатаПоследнейПоверки = ВыборкаПоследнейПоверки[0].Период;
		КонецЕсли; 
		
		ВыборкаСледующейПоверки = ТаблицаСледующейПоверки.НайтиСтроки(Новый Структура("ПриборУчета", НоваяСтрока.ПриборУчета));   
		Если ВыборкаСледующейПоверки.Количество() > 0  Тогда
			НоваяСтрока.ДатаСледующейПоверки = ВыборкаСледующейПоверки[0].Период;
		КонецЕсли; 
		
	КонецЦикла;
	
	// Сформировать ввод показаний приборов учета
	
	ТаблицаУслуг = Объект.ПриборыУчета.Выгрузить( ,"Услуга");
	ТаблицаУслуг.Свернуть("Услуга", );
	
	Для Каждого СтрокаУслуг Из ТаблицаУслуг Цикл
		
		НайденныеСтроки = Объект.ПриборыУчета.НайтиСтроки(Новый Структура("Услуга", СтрокаУслуг.Услуга));
		
		ДокВводПоказанийПриборовУчета = Документы.ВводПоказанийПриборовУчета.СоздатьДокумент();
		ДокВводПоказанийПриборовУчета.Дата = Объект.Дата;
		ДокВводПоказанийПриборовУчета.Организация = Объект.Организация;
		ДокВводПоказанийПриборовУчета.Здание = Объект.Здание;
		ДокВводПоказанийПриборовУчета.Услуга = СтрокаУслуг.Услуга;
		
		ДокВводПоказанийПриборовУчета.Автор = Пользователи.ТекущийПользователь();
		ДокВводПоказанийПриборовУчета.ПериодНачисления = КонецМесяца(Объект.Дата);
		
		ДокВводПоказанийПриборовУчета.Комментарий = Комментарий;
		
		Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
			НоваяСтрока = ДокВводПоказанийПриборовУчета.Основная.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, НайденнаяСтрока); 
			НоваяСтрока.ОтветственныйВладелец = СтарыйОтветственныйВладелец;
		КонецЦикла;
		
		ДокВводПоказанийПриборовУчета.Записать(РежимЗаписиДокумента.Проведение);
		
		СтрокаСформированныеДокументы = Объект.СформированныеДокументы.Добавить();
		СтрокаСформированныеДокументы.Документ = ДокВводПоказанийПриборовУчета.Ссылка;
		
	КонецЦикла;
	
	// Документ ЗакрытиеЛицевогоСчета	
	ДокументЗакрытиеЛицевогоСчета = Документы.ЗакрытиеЛицевогоСчета.СоздатьДокумент();
	ДокументЗакрытиеЛицевогоСчета.Автор = Пользователи.ТекущийПользователь();
	ДокументЗакрытиеЛицевогоСчета.Дата = Объект.Дата;	
	ДокументЗакрытиеЛицевогоСчета.ЛицевойСчет = Объект.ЛицевойСчет;
	ДокументЗакрытиеЛицевогоСчета.Организация = Объект.Организация;
	ДокументЗакрытиеЛицевогоСчета.Здание = Объект.Здание;
	ДокументЗакрытиеЛицевогоСчета.Комментарий = Комментарий;
	
	ДокументЗакрытиеЛицевогоСчета.Записать(РежимЗаписиДокумента.Проведение);
	
	СтрокаСформированныеДокументы = Объект.СформированныеДокументы.Добавить();
	СтрокаСформированныеДокументы.Документ = ДокументЗакрытиеЛицевогоСчета.Ссылка;
	
	// Новый Лицевой Счет
	НовыйЛС = Справочники.ЛицевыеСчета.СоздатьЭлемент();
	НовыйЛС.ОбъектЛицевогоСчета = Объект.ЛицевойСчет.ОбъектЛицевогоСчета; 
	НовыйЛС.Владелец = Объект.Здание;
	НовыйЛС.Наименование = Объект.НаименованиеЛС;
	НовыйЛС.Записать();
	
	ЛССсылка = НовыйЛС.Ссылка;
			
	// Документ ОткрытиеЛицевогоСчета
	ДокументОткрытиеЛицевогоСчета = Документы.ОткрытиеЛицевогоСчета.СоздатьДокумент();
	ДокументОткрытиеЛицевогоСчета.Автор = Пользователи.ТекущийПользователь();
	ДокументОткрытиеЛицевогоСчета.Дата = Объект.Дата;	
	ДокументОткрытиеЛицевогоСчета.ЛицевойСчет = ЛССсылка;
	ДокументОткрытиеЛицевогоСчета.Организация = Объект.Организация;
	ДокументОткрытиеЛицевогоСчета.Здание = Объект.Здание;
	
	ДокументОткрытиеЛицевогоСчета.ОтветственныйВладелец = Объект.ОтветственныйВладелец;
	ДокументОткрытиеЛицевогоСчета.КоличествоПрописанных = Объект.КоличествоПрописанных;
	ДокументОткрытиеЛицевогоСчета.КоличествоПроживающих = Объект.КоличествоПроживающих;
	ДокументОткрытиеЛицевогоСчета.Комментарий = Комментарий;
	
	ДокументОткрытиеЛицевогоСчета.Записать(РежимЗаписиДокумента.Проведение);
	
	СтрокаСформированныеДокументы = Объект.СформированныеДокументы.Добавить();
	СтрокаСформированныеДокументы.Документ = ДокументОткрытиеЛицевогоСчета.Ссылка;
	
	 //Документ УправлениеУслугами
	ДокументУправлениеУслугами = Документы.УправлениеУслугами.СоздатьДокумент();	
	ДокументУправлениеУслугами.Автор = Пользователи.ТекущийПользователь();
	ДокументУправлениеУслугами.Организация = Объект.Организация;
	ДокументУправлениеУслугами.Дата = Объект.Дата;
	ДокументУправлениеУслугами.ВидОперации = Перечисления.ВидыОперацийУправленияУслугами.НазначениеУслуги;
	ДокументУправлениеУслугами.Здание = Объект.Здание;
	ДокументУправлениеУслугами.ДатаНачала = Объект.Дата;
	ДокументУправлениеУслугами.Комментарий = Комментарий;
	
	НоваяСтрока = ДокументУправлениеУслугами.ЛицевыеСчета.Добавить();
	НоваяСтрока.ЛицевойСчет = ЛССсылка;
	
	Для каждого СтрокаУслуги Из ТаблицаУслугЛС Цикл
		
		НоваяСтрока = ДокументУправлениеУслугами.Услуги.Добавить();	
		НоваяСтрока.Услуга = СтрокаУслуги.Услуга;
				
	КонецЦикла;
	Если ДокументУправлениеУслугами.Услуги.Количество() > 0 Тогда
		ДокументУправлениеУслугами.Записать(РежимЗаписиДокумента.Проведение);
		
		СтрокаСформированныеДокументы = Объект.СформированныеДокументы.Добавить();
		СтрокаСформированныеДокументы.Документ = ДокументУправлениеУслугами.Ссылка;
		
	КонецЕсли;
	
	 //Документ УправлениеУслугамиПодробно
	ТаблицаУслугУслугиПодробно = ТаблицаУслугПодробно.Скопировать( ,"Услуга");
	ТаблицаУслугУслугиПодробно.Свернуть("Услуга", );
	Для Каждого СтрокаУслуг Из ТаблицаУслугУслугиПодробно Цикл
		
		НайденныеСтроки = ТаблицаУслугПодробно.НайтиСтроки(Новый Структура("Услуга", СтрокаУслуг.Услуга));
	 
		ДокументУправлениеУслугамиПодробно = Документы.УправлениеУслугамиПодробно.СоздатьДокумент();	
		ДокументУправлениеУслугамиПодробно.Автор = Пользователи.ТекущийПользователь();
		ДокументУправлениеУслугамиПодробно.Организация = Объект.Организация;
		ДокументУправлениеУслугамиПодробно.Дата = Объект.Дата;
		ДокументУправлениеУслугамиПодробно.ВидОперации = Перечисления.ВидыОперацийУправленияУслугами.НазначениеУслуги;
		ДокументУправлениеУслугамиПодробно.Здание = Объект.Здание;
		ДокументУправлениеУслугамиПодробно.Услуга = СтрокаУслуг.Услуга;
		ДокументУправлениеУслугамиПодробно.ДатаНачала = Объект.Дата;
		ДокументУправлениеУслугамиПодробно.Комментарий = Комментарий;
		
		НоваяСтрока = ДокументУправлениеУслугамиПодробно.ЛицевыеСчета.Добавить();
		НоваяСтрока.ЛицевойСчет = ЛССсылка;
		
		Для каждого СтрокаУслугиПодробно Из НайденныеСтроки Цикл
			
			НоваяСтрока = ДокументУправлениеУслугамиПодробно.УслугиПодробно.Добавить();	
			НоваяСтрока.УслугаПодробно = СтрокаУслугиПодробно.УслугаПодробно;
					
		КонецЦикла;
		Если ДокументУправлениеУслугамиПодробно.УслугиПодробно.Количество() > 0 Тогда
			ДокументУправлениеУслугамиПодробно.Записать(РежимЗаписиДокумента.Проведение);
			
			СтрокаСформированныеДокументы = Объект.СформированныеДокументы.Добавить();
			СтрокаСформированныеДокументы.Документ = ДокументУправлениеУслугамиПодробно.Ссылка;
			
		КонецЕсли;
	КонецЦикла;
	
	 //Документ ИзменениеЛицевогоСчета 
	ДокументИзменениеЛицевогоСчета = Документы.ИзменениеЛицевогоСчета.СоздатьДокумент();	
	ДокументИзменениеЛицевогоСчета.Автор = Пользователи.ТекущийПользователь();
	ДокументИзменениеЛицевогоСчета.Организация = Объект.Организация;
	ДокументИзменениеЛицевогоСчета.Дата = Объект.Дата;
	ДокументИзменениеЛицевогоСчета.ЛицевойСчет = ЛССсылка;
	ДокументИзменениеЛицевогоСчета.ВидОперации = Перечисления.ВидыОперацийИзменениеЛицевогоСчета.ИзменениеМашиноМест;
	ДокументИзменениеЛицевогоСчета.Здание = Объект.Здание;
	ДокументИзменениеЛицевогоСчета.Комментарий = Комментарий;
	
	Для каждого СтрокаМашиноМест Из ТаблицаМашиноМест Цикл
		
		НоваяСтрока = ДокументИзменениеЛицевогоСчета.МашиноМеста.Добавить();	
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаМашиноМест);
		
	КонецЦикла;
	Если ДокументИзменениеЛицевогоСчета.МашиноМеста.Количество() > 0 Тогда
		ДокументИзменениеЛицевогоСчета.Записать(РежимЗаписиДокумента.Проведение);
		
		СтрокаСформированныеДокументы = Объект.СформированныеДокументы.Добавить();
		СтрокаСформированныеДокументы.Документ = ДокументИзменениеЛицевогоСчета.Ссылка;
		
	КонецЕсли;
	
	Если ТаблицаПриборовУчета.Количество() > 0 Тогда	
		
		// Документ управление приборами учета
		ДокументУправлениеПриборамиУчета = Документы.УправлениеПриборамиУчета.СоздатьДокумент();
		ДокументУправлениеПриборамиУчета.Автор = Пользователи.ТекущийПользователь();
		ДокументУправлениеПриборамиУчета.ВидОперации = Перечисления.ВидыОперацийУправленияПриборамиУчета.УстановкаПрибораУчета;
		ДокументУправлениеПриборамиУчета.ОбъектУстановки = ЛССсылка;
		ДокументУправлениеПриборамиУчета.Дата = Объект.Дата;
		ДокументУправлениеПриборамиУчета.Организация = Объект.Организация;
		ДокументУправлениеПриборамиУчета.Здание = Объект.Здание;
		ДокументУправлениеПриборамиУчета.Комментарий = Комментарий;
		
		Для Каждого СтрокаПриборыУчета Из ТаблицаПриборовУчета Цикл
			
			НоваяСтрока = ДокументУправлениеПриборамиУчета.ПриборыУчета.Добавить();
			НоваяСтрока.ПриборУчета = СтрокаПриборыУчета.ПриборУчета;
			НоваяСтрока.ДатаВключения = Объект.Дата;	
			НоваяСтрока.ДатаПоследнейПоверки = СтрокаПриборыУчета.ДатаПоследнейПоверки;
			НоваяСтрока.ДатаСледующейПоверки = СтрокаПриборыУчета.ДатаСледующейПоверки;
			НоваяСтрока.НачальноеПоказание = СтрокаПриборыУчета.НачальноеПоказание;
			НоваяСтрока.ВидТарифа = СтрокаПриборыУчета.ВидТарифа;
			
		КонецЦикла;	
		
		Если ДокументУправлениеПриборамиУчета.ПриборыУчета.Количество() > 0 Тогда
			ДокументУправлениеПриборамиУчета.Записать(РежимЗаписиДокумента.Проведение);
			
			СтрокаСформированныеДокументы = Объект.СформированныеДокументы.Добавить();
			СтрокаСформированныеДокументы.Документ = ДокументУправлениеПриборамиУчета.Ссылка;
			
		КонецЕсли;
	КонецЕсли;

	// Документ НачислениеПоЛС
	
	МассивЛицевыхСчетов = Новый Массив();
	МассивЛицевыхСчетов.Добавить(Объект.ЛицевойСчет);
	
	СтруктураДляРасчета = Новый Структура;
	
	СтруктураДляРасчета.Вставить("ЛицевыеСчета", МассивЛицевыхСчетов); 
	СтруктураДляРасчета.Вставить("ПериодНачисления", КонецМесяца(Объект.Дата));
	СтруктураДляРасчета.Вставить("Услуга", Справочники.Услуги.ПустаяСсылка()); 
	
	СтруктураДляРасчета = УчетКоммунальныхУслуг.РассчитатьСуммыНачислений(СтруктураДляРасчета);
	
	ДокументНачислениеПоЛС = Документы.НачислениеПоЛС.СоздатьДокумент();
	ДокументНачислениеПоЛС.Дата = Объект.Дата;
	ДокументНачислениеПоЛС.ПериодНачисления = КонецМесяца(Объект.Дата);
	ДокументНачислениеПоЛС.Организация = Объект.Организация;
	ДокументНачислениеПоЛС.Здание = Объект.Здание;
	ДокументНачислениеПоЛС.Комментарий = Комментарий; 
	
	ДокументНачислениеПоЛС.Услуги.Загрузить(СтруктураДляРасчета.НоваяТаблицаУслуг);
	ДокументНачислениеПоЛС.Льготы.Загрузить(СтруктураДляРасчета.НоваяТаблицаЛьгот);
	
	ДокументНачислениеПоЛС.Автор  = Пользователи.ТекущийПользователь();

	ДокументНачислениеПоЛС.Записать(РежимЗаписиДокумента.Проведение);
	
	СтрокаСформированныеДокументы = Объект.СформированныеДокументы.Добавить();
	СтрокаСформированныеДокументы.Документ = ДокументНачислениеПоЛС.Ссылка;
	
	
	Если Объект.ВыпоняетсяПередачаДолга Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	СУММА(РасчетыПоЛицевымСчетамОстатки.СуммаОстаток) КАК СуммаОстаток,
			|	РасчетыПоЛицевымСчетамОстатки.ЛицевойСчет
			|ИЗ
			|	РегистрНакопления.РасчетыПоЛицевымСчетам.Остатки(&Период, ЛицевойСчет = &ЛицевойСчет) КАК РасчетыПоЛицевымСчетамОстатки
			|
			|СГРУППИРОВАТЬ ПО
			|	РасчетыПоЛицевымСчетамОстатки.ЛицевойСчет";
			
		Запрос.УстановитьПараметр("Период", Новый Граница(КонецМесяца(Объект.Дата), ВидГраницы.Включая));
		Запрос.УстановитьПараметр("ЛицевойСчет", Объект.ЛицевойСчет);
		
		Результат = Запрос.Выполнить().Выбрать();
		Если Результат.Следующий() Тогда
			СуммаДолга = Результат.СуммаОстаток;
		Иначе	
			СуммаДолга = 0;
		КонецЕсли; 
		
		Если СуммаДолга <> 0 Тогда
		
			// Документ КорректировкаДолга
			ДокументКорректировкаДолга = Документы.КорректировкаДолга.СоздатьДокумент();	
			ДокументКорректировкаДолга.Автор = Пользователи.ТекущийПользователь();
			ДокументКорректировкаДолга.Организация = Объект.Организация;
			ДокументКорректировкаДолга.Дата = Объект.Дата;
			ДокументКорректировкаДолга.ВидОперации = Перечисления.ВидыОперацийКорректировкаДолга.ПереносЗадолженности;
			
			Если СуммаДолга > 0 Тогда
				ДокументКорректировкаДолга.ЛицевойСчетДебитор = Объект.ЛицевойСчет ;
				ДокументКорректировкаДолга.ЛицевойСчетКредитор = ЛССсылка ;
				ДокументКорректировкаДолга.СуммаКорректировки = СуммаДолга;
			Иначе
				ДокументКорректировкаДолга.ЛицевойСчетДебитор = ЛССсылка;
				ДокументКорректировкаДолга.ЛицевойСчетКредитор = Объект.ЛицевойСчет;
				ДокументКорректировкаДолга.СуммаКорректировки = -СуммаДолга;
				
			КонецЕсли;
			
			ДокументКорректировкаДолга.Комментарий = Комментарий;
			
			ДокументКорректировкаДолга.Записать(РежимЗаписиДокумента.Проведение);
			
			СтрокаСформированныеДокументы = Объект.СформированныеДокументы.Добавить();
			СтрокаСформированныеДокументы.Документ = ДокументКорректировкаДолга.Ссылка;
			
		КонецЕсли;
		
	КонецЕсли;	
	
	ЗафиксироватьТранзакцию();
	
	Элементы.ГруппаПриборыУчета.Видимость = Ложь;
	Элементы.ГруппаСформированныеДокументы.Видимость = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ЛицевойСчетПриИзменении(Элемент)
	ЛицевойСчетПриИзмененииНаСервере();	
КонецПроцедуры

&НаСервере
Процедура ЛицевойСчетПриИзмененииНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВложенныйЗапрос.ПриборУчета КАК ПриборУчета,
		|	ВложенныйЗапрос.ОбъектУстановки КАК ОбъектУстановки,
		|	ВложенныйЗапрос.ПоказаниеПредыдущее,
		|	ВложенныйЗапрос.ВидТарифа,
		|	ВложенныйЗапрос.Услуга КАК Услуга,
		|	ВложенныйЗапрос.Показание,
		|	ВложенныйЗапрос.Отключен КАК Отключен,
		|	ВложенныйЗапрос.ОбъектЛицевогоСчета,
		|	ВложенныйЗапрос.Коэффициент
		|ИЗ
		|	(ВЫБРАТЬ
		|		ЗаменыПриборовУчетаОбороты.ОбъектУстановки КАК ОбъектУстановки,
		|		ЗаменыПриборовУчетаОбороты.ПриборУчета КАК ПриборУчета,
		|		ЗаменыПриборовУчетаОбороты.Услуга КАК Услуга,
		|		ЗаменыПриборовУчетаОбороты.ВидТарифа КАК ВидТарифа,
		|		ЗаменыПриборовУчетаОбороты.ПоказаниеПредыдущееОборот КАК ПоказаниеПредыдущее,
		|		ЗаменыПриборовУчетаОбороты.ПоказаниеОборот КАК Показание,
		|		ИСТИНА КАК Отключен,
		|		ЗаменыПриборовУчетаОбороты.ОбъектУстановки.ОбъектЛицевогоСчета КАК ОбъектЛицевогоСчета,
		|		ЗаменыПриборовУчетаОбороты.ПриборУчета.Коэффициент КАК Коэффициент
		|	ИЗ
		|		РегистрНакопления.ЗаменыПриборовУчета.Обороты(&НачПериода, &КонПериода, Месяц, ОбъектУстановки = &ОбъектыУстановки) КАК ЗаменыПриборовУчетаОбороты
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		УстановленныеПриборыУчетаСрезПоследних.ОбъектУстановки,
		|		УстановленныеПриборыУчетаСрезПоследних.ПриборУчета,
		|		ПоказанияПриборовУчетаСрезПоследних.ПриборУчета.Услуга,
		|		ПоказанияПриборовУчетаСрезПоследних.ВидТарифа,
		|		ПоказанияПриборовУчетаСрезПоследних.Значение,
		|		0,
		|		ЛОЖЬ,
		|		УстановленныеПриборыУчетаСрезПоследних.ОбъектУстановки.ОбъектЛицевогоСчета,
		|		УстановленныеПриборыУчетаСрезПоследних.ПриборУчета.Коэффициент
		|	ИЗ
		|		РегистрСведений.УстановленныеПриборыУчета.СрезПоследних(&КонПериода, ОбъектУстановки = &ОбъектыУстановки) КАК УстановленныеПриборыУчетаСрезПоследних
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПоказанияПриборовУчета.СрезПоследних(&КонПериода, ) КАК ПоказанияПриборовУчетаСрезПоследних
		|			ПО УстановленныеПриборыУчетаСрезПоследних.ПриборУчета = ПоказанияПриборовУчетаСрезПоследних.ПриборУчета
		|	ГДЕ
		|		УстановленныеПриборыУчетаСрезПоследних.Действует = ИСТИНА) КАК ВложенныйЗапрос
		|
		|УПОРЯДОЧИТЬ ПО
		|	ОбъектУстановки,
		|	Отключен УБЫВ,
		|	ПриборУчета";
		
	Запрос.Параметры.Вставить("НачПериода", НачалоМесяца(Объект.Дата));
	Запрос.Параметры.Вставить("КонПериода", КонецМесяца(Объект.Дата));
	
	Запрос.Параметры.Вставить("ОбъектыУстановки", Объект.ЛицевойСчет);
	
	ВыборкаЛС = Запрос.Выполнить().Выбрать();
	
	Объект.ПриборыУчета.Очистить();
	
	Пока ВыборкаЛС.Следующий() Цикл
		
		НоваяСтрока = Объект.ПриборыУчета.Добавить();
		НоваяСтрока.ОбъектУстановки = ВыборкаЛС.ОбъектУстановки;
		НоваяСтрока.ПриборУчета = ВыборкаЛС.ПриборУчета;
		НоваяСтрока.ПоказаниеПредыдущее = ВыборкаЛС.ПоказаниеПредыдущее;
		Если  ВыборкаЛС.Показание = 0 Тогда
			НоваяСтрока.Показание = ВыборкаЛС.ПоказаниеПредыдущее;
		Иначе
			НоваяСтрока.Показание = ВыборкаЛС.Показание;
		КонецЕсли;
		НоваяСтрока.Коэффициент = ВыборкаЛС.Коэффициент;
		НоваяСтрока.Отключен = ВыборкаЛС.Отключен;
		НоваяСтрока.ВидТарифа = ВыборкаЛС.ВидТарифа;
		НоваяСтрока.Услуга = ВыборкаЛС.Услуга;
		НоваяСтрока.ОбъектЛицевогоСчета = ВыборкаЛС.ОбъектЛицевогоСчета;
				
	КонецЦикла;
	
	Объект.ПриборыУчета.Сортировать("ОбъектУстановки, ПриборУчета, Отключен Убыв");   
	
	Для каждого СтрокаОсновная Из Объект.ПриборыУчета Цикл
		
		Если СтрокаОсновная.Показание = 0 Тогда
			Продолжить;
		КонецЕсли; 
		
		СтруктураДанные = Новый Структура();
		СтруктураДанные.Вставить("ПриборУчета", СтрокаОсновная.ПриборУчета);
		СтруктураДанные.Вставить("ПредыдущееПоказание", СтрокаОсновная.ПоказаниеПредыдущее);
		СтруктураДанные.Вставить("ТекущееПоказание", СтрокаОсновная.Показание);
		
		СтруктураДанные = Справочники.ПриборыУчета.ПолучитьРасход(СтруктураДанные);
		
		СтрокаОсновная.Разница = СтруктураДанные.РасходПоПриборуУчета;
		СтрокаОсновная.ПереходЧерезНоль = СтруктураДанные.ЕстьПереходПоказанийЧерезНоль;
		СтрокаОсновная.РасходЗаПериодРасчета = СтруктураДанные.РасходЗаПериодРасчета;
	
	КонецЦикла; 	

	Объект.НаименованиеЛС = Объект.ЛицевойСчет.Наименование;
	Объект.Организация = Объект.ЛицевойСчет.Владелец.Организация;
	Объект.Здание = Объект.ЛицевойСчет.Владелец;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриборыУчетаПоказаниеПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ПриборыУчета.ТекущиеДанные;
	Если Не ТекущиеДанные = Неопределено Тогда
		
		СтруктураДанные = Новый Структура();
		СтруктураДанные.Вставить("ПриборУчета", ТекущиеДанные.ПриборУчета);
		СтруктураДанные.Вставить("ПредыдущееПоказание", ТекущиеДанные.ПоказаниеПредыдущее);
		СтруктураДанные.Вставить("ТекущееПоказание", ТекущиеДанные.Показание);
		
		СтруктураДанные = ПолучитьДанныеОсновнаяПоказаниеПриИзменении(СтруктураДанные);
		
		Если ЗначениеЗаполнено(СтруктураДанные.ТекстОшибки) Тогда
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтруктураДанные.ТекстОшибки);

			ТекущиеДанные.Показание = ПоказаниеПередРедактированием;
			
			Возврат;
		КонецЕсли;
		
		ТекущиеДанные.Разница = СтруктураДанные.РасходПоПриборуУчета;
		ТекущиеДанные.ПереходЧерезНоль = СтруктураДанные.ЕстьПереходПоказанийЧерезНоль;
		ТекущиеДанные.РасходЗаПериодРасчета = СтруктураДанные.РасходЗаПериодРасчета;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьДанныеОсновнаяПоказаниеПриИзменении(СтруктураДанные)
	
	СтруктураДанные = Справочники.ПриборыУчета.ПолучитьРасход(СтруктураДанные);
	
	Возврат СтруктураДанные;
	
КонецФункции

&НаКлиенте
Процедура ПриборыУчетаПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	ТекущиеДанные = Элемент.ТекущиеДанные;
   	Если Не ТекущиеДанные = Неопределено Тогда
    	ПоказаниеПередРедактированием = ТекущиеДанные.Показание;
	КонецЕсли;
	
КонецПроцедуры
